{"keras_version": "2.1.5", "config": [{"config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "axis": -1, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "epsilon": 0.001, "momentum": 0.99, "scale": true, "beta_constraint": null, "name": "batch_normalization_3", "batch_input_shape": [null, 96, 96, 1], "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_7", "kernel_initializer": {"config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 24}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_5", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_8", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 36}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_6", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [5, 5], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_9", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 48}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_7", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_10", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_8", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "use_bias": true, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null, "name": "conv2d_11", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "filters": 64}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 500, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 90, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "units": 30, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_6", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}